78/xiaozhi-esp32/managed_components/78__esp-wifi-connect/wifi_configuration_ap.cc
            // 保存显示屏GPIO设置
            auto save_gpio = [&](const char* json_key, const char* nvs_key, int8_t& member) {
                cJSON *item = cJSON_GetObjectItem(json, json_key);
                if (cJSON_IsNumber(item)) {
                    member = (int8_t)item->valueint;
                    nvs_set_i8(nvs, nvs_key, member);
                }
            };
            save_gpio("display_mosi", "disp_mosi", this_->display_mosi_);
            save_gpio("display_clk", "disp_clk", this_->display_clk_);
            save_gpio("display_dc", "disp_dc", this_->display_dc_);
            save_gpio("display_rst", "disp_rst", this_->display_rst_);
            save_gpio("display_cs", "disp_cs", this_->display_cs_);
            save_gpio("display_bl", "disp_bl", this_->display_bl_);

            // 保存音频GPIO设置
            save_gpio("audio_i2s_bclk", "aud_bclk", this_->audio_i2s_bclk_);
            save_gpio("audio_i2s_ws", "aud_ws", this_->audio_i2s_ws_);
            save_gpio("audio_i2s_dout", "aud_dout", this_->audio_i2s_dout_);
            save_gpio("audio_i2s_din", "aud_din", this_->audio_i2s_din_);
            save_gpio("audio_pa_enable", "aud_pa", this_->audio_pa_enable_);
            save_gpio("audio_volume", "aud_vol", this_->audio_volume_);

            // 保存显示外观设置
            save_gpio("display_orientation", "disp_ori", this_->display_orientation_);
            save_gpio("display_brightness", "disp_bri", this_->display_brightness_);
            
            cJSON* theme_item = cJSON_GetObjectItem(json, "display_theme");
            if (cJSON_IsString(theme_item)) {
                this_->display_theme_ = theme_item->valuestring;
                nvs_handle_t display_nvs;
                if (nvs_open("display", NVS_READWRITE, &display_nvs) == ESP_OK) {
                    nvs_set_str(display_nvs, "theme", this_->display_theme_.c_str());
                    nvs_commit(display_nvs);
                    nvs_close(display_nvs);
                }
            }

            // 提交更改
            err = nvs_commit(nvs);
            nvs_close(nvs);
            cJSON_Delete(json);

            if (err != ESP_OK) {
                httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Failed to save configuration");
                return ESP_FAIL;
            }

            // 发送成功响应
            httpd_resp_set_type(req, "application/json");
            httpd_resp_set_hdr(req, "Connection", "close");
            httpd_resp_send(req, "{\"success\":true}", HTTPD_RESP_USE_STRLEN);

            ESP_LOGI(TAG, "Saved settings: ota_url=%s, max_tx_power=%d, remember_bssid=%d, sleep_mode=%d",
                this_->ota_url_.c_str(), this_->max_tx_power_, this_->remember_bssid_, this_->sleep_mode_);
            return ESP_OK;
        },
        .user_ctx = this
    };
    ESP_ERROR_CHECK(httpd_register_uri_handler(server_, &advanced_submit_uri));

    // Register the /reboot URI
    httpd_uri_t reboot_uri = {
        .uri = "/reboot",
        .method = HTTP_POST,
        .handler = [](httpd_req_t *req) -> esp_err_t {
            httpd_resp_set_type(req, "application/json");
            httpd_resp_sendstr(req, "{\"success\":true}");
            
            ESP_LOGI("WifiConfigurationAp", "Rebooting in 1 second...");
            esp_timer_handle_t reboot_timer;
            esp_timer_create_args_t reboot_timer_args = {
                .callback = [](void* arg) {
                    esp_restart();
                },
                .arg = nullptr,
                .dispatch_method = ESP_TIMER_TASK,
                .name = "reboot_timer"
            };
            esp_timer_create(&reboot_timer_args, &reboot_timer);
            esp_timer_start_once(reboot_timer, 1000000);
            return ESP_OK;
        },
        .user_ctx = this
    };
    ESP_ERROR_CHECK(httpd_register_uri_handler(server_, &reboot_uri));

    // Register the /reset_wifi URI
    httpd_uri_t reset_wifi_uri = {
        .uri = "/reset_wifi",
        .method = HTTP_POST,
        .handler = [](httpd_req_t *req) -> esp_err_t {
            nvs_handle_t nvs;
            if (nvs_open("wifi", NVS_READWRITE, &nvs) == ESP_OK) {
                nvs_erase_all(nvs);
                nvs_commit(nvs);
                nvs_close(nvs);
            }
            
            httpd_resp_set_type(req, "application/json");
            httpd_resp_sendstr(req, "{\"success\":true}");
            return ESP_OK;
        },
        .user_ctx = this
    };
    ESP_ERROR_CHECK(httpd_register_uri_handler(server_, &reset_wifi_uri));

    // Register the /system/info URI for commercial status monitoring
    httpd_uri_t system_info_uri = {
        .uri = "/system/info",
        .method = HTTP_GET,
        .handler = [](httpd_req_t *req) -> esp_err_t {
            // Get MAC
            char mac_str[18];
            uint8_t mac[6];
            esp_read_mac(mac, ESP_MAC_WIFI_STA);
            sprintf(mac_str, "%02X:%02X:%02X:%02X:%02X:%02X", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);

            // Get Uptime & RAM
            uint32_t uptime = esp_timer_get_time() / 1000000;
            size_t free_heap = esp_get_free_heap_size();
            size_t total_heap = heap_caps_get_total_size(MALLOC_CAP_8BIT);

            // Get RSSI (if connected)
            int rssi = 0;
            wifi_ap_record_t info;
            if (esp_wifi_sta_get_ap_info(&info) == ESP_OK) {
                rssi = info.rssi;
            }

            // Get Temperature (Approximate or via sensor if available)
            float temp = 0;
#if CONFIG_IDF_TARGET_ESP32S3 || CONFIG_IDF_TARGET_ESP32C3
            // Simplified internal temp read for modern ESP32
            // Note: In production, you'd use the temperature_sensor driver
            temp = 42.5; // Placeholder for now, real sensor needs driver initialization
#endif

            char json_response[512];
            snprintf(json_response, sizeof(json_response),
                     "{\"model\":\"XiaoZhi-ESP32\",\"version\":\"1.2.0-stable\",\"mac\":\"%s\",\"uptime\":%lu,\"heap_free\":%u,\"heap_total\":%u,\"rssi\":%d,\"temp\":%.1f}",
                     mac_str, uptime, (unsigned int)free_heap, (unsigned int)total_heap, rssi, temp);

            httpd_resp_set_type(req, "application/json");
            httpd_resp_sendstr(req, json_response);
            return ESP_OK;
        },
        .user_ctx = this
    };
    ESP_ERROR_CHECK(httpd_register_uri_handler(server_, &system_info_uri));

    // Register the /log_data URI
    httpd_uri_t log_data_uri = {
        .uri = "/log_data",
        .method = HTTP_GET,
        .handler = [](httpd_req_t *req) -> esp_err_t {
            httpd_resp_set_type(req, "text/plain");
            httpd_resp_set_hdr(req, "Connection", "close");
            
            std::lock_guard<std::mutex> lock(log_mutex_);
            if (log_buffer_ == nullptr) {
                httpd_resp_send(req, "", 0);
                return ESP_OK;
            }

            // Send in two parts if wrapped
            size_t pos = log_pos_;
            httpd_resp_send_chunk(req, log_buffer_ + pos, LOG_BUFFER_SIZE - pos);
            httpd_resp_send_chunk(req, log_buffer_, pos);
            httpd_resp_send_chunk(req, NULL, 0);
            return ESP_OK;
        },
        .user_ctx = this
    };
    ESP_ERROR_CHECK(httpd_register_uri_handler(server_, &log_data_uri));

    // Register the /update URI for Web OTA (Binary Upload)
    httpd_uri_t update_uri = {
        .uri = "/update",
        .method = HTTP_POST,
        .handler = [](httpd_req_t *req) -> esp_err_t {
            esp_ota_handle_t update_handle = 0;
            const esp_partition_t *update_partition = esp_ota_get_next_update_partition(NULL);
            
            if (update_partition == NULL) {
                ESP_LOGE("OTA", "Passive OTA partition not found");
                httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "OTA partition not found");
                return ESP_FAIL;
            }

            ESP_LOGI("OTA", "Writing to partition subtype %d at offset 0x%lx",
                     update_partition->subtype, update_partition->address);

